blog-posts/2003-10-23-emacs-weirdness.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs weirdness</title>
<!-- 2015-01-07 Wed 14:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs weirdness</h1>
<p>
October 23rd, 2003 -
<a href="http://sachachua.com/blog/p/1263"><a href="http://sachachua.com/blog/p/1263">http://sachachua.com/blog/p/1263</a></a>
</p>

<p>
For some reason, local-write-file-hooks had the BBDB stuff in it, so
 cookies were getting added to my data&#x2026;
</p>

<p>
Hmm. Test script.
</p>

<pre class="example">
(let ((old-hook local-write-file-hooks))
    (with-temp-buffer (add-hook 'local-write-file-hooks 'foo))
    (unless (equal local-write-file-hooks old-hook)
      (error "Failed test. local-write-file-hooks was modified in this buffer."))
    ;; Let's put things back the way they were
    (setq-default local-write-file-hooks old-hook))
</pre>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
